cask '1password'						# Password Manager
brew 'blueutil'							# Command-line Bluetooth utility
cask 'raycast'							# Spotlight replacement
cask 'adobe-acrobat-reader'			    # PDF reader used for digital signatures
cask 'sanesidebuttons'					# Mouse side button utility
cask 'the-unarchiver'					# File extractor
brew 'stow'								# Symlink farm manager
brew 'starship'							# Shell prompt
brew 'fzf'								# Command-line fuzzy finder
# cask 'cursor'							# Code editor w/ AI integration
cask 'visual-studio-code'				# Code editor
brew 'neovim'							# Text editor
cask 'warp'								# Terminal emulator
cask 'discord'							# Chat platform for gamers/communities
# cask 'nvidia-geforce-now'				# Cloud gaming (Disabled because it's broken)
cask 'slack'							# Team communication
cask 'whatsapp'							# Messaging app
cask 'spotify'							# Music streaming
cask 'arc'
cask 'dbeaver-community'				# Database tool
brew 'nvm'								# Node Version Manager
cask 'orbstack'							# Docker Alternative (for containers/VMs)
cask 'postman'							# API Development Tool
brew 'pyenv'							# Python version management
brew 'zoxide'							# Smarter cd command
brew 'zsh-autocomplete'					# Autocompletion for Zsh
brew 'eza'								# A modern, maintained replacement for ls, written in rust
cask 'font-jetbrains-mono'				# JetBrains Mono font
cask 'font-jetbrains-mono-nerd-font'	# JetBrains Mono Nerd Font
cask 'font-hack-nerd-font'				# Hack Nerd Font
brew 'curl'								# Command-line tool for transferring data
cask 'ngrok'							# Secure introspectable tunnels to localhost
cask 'steam'                            # Gaming platform
cask 'unity-hub'						# Game engine
# cask 'affinity-designer@1'  # Illustrator alternative
# cask 'affinity-photo@1' 		# Photoshop alternative
cask 'zoom'								# Video conferencing
cask 'moonlight'					# Game streaming
# brew 'tailscale'					# Layer 3 proxy
# cask 'soundsource'				# Audio mixer
